app/views/dashboard/index.html.erb

    <tbody>
      <% @patients.sort_by { |p| p.oldest_unpaid_transaction&.date || Time.now }.each do |patient| %>
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."patient_id" = $1  [["patient_id", 1]]