lib/tasks/import_patient_data.rake

INSERT INTO "patients" ("first_name", "last_name", "phone_number", "email", "gender", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def gender
      if @data["Gender"] == "Female"
        return 1
      else
        return 0
      end
    end

    Patient.create(first_name: @data["First Name"],
                   last_name: @data["Last Name"],
                   gender: gender,
                   age: @data["Age"],
                   email: @data["Email"],
                   phone_number: @data["Phone"])