lib/tasks/import_transaction_data.rake

task :import_transaction_data => :environment do
  CSV.foreach(TRANSACTIONS, headers: true) do |row|
    data = row.to_h

    Transaction.create(cdt_code: data["CDT Code"],
                       amount: data["Amount"],
                       date: data["Date"],
                       performed_by: data["Performed By"],
                       patient_id: data["Patient ID"])
---
INSERT INTO "transactions" ("cdt_code", "amount", "date", "performed_by", "patient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"