lib/tasks/import_transaction_code_data.rake

    def entry_type
      if @data["entry_type"] == "Payment"
        return 1
      else
        return 0
      end
    end

    TransactionCode.create(entry_type: @data["entry_type"],
                       title: @data["title"],
                       cdt_code: @data["cdt_code"],
                       description: @data["description By"])
---
INSERT INTO "transaction_codes" ("entry_type", "title", "cdt_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["entry_type", 0], ["title", "periodic oral evaluation established patient"], ["cdt_code", 120], ["created_at", "2022-06-09 05:24:59.999486"], ["updated_at", "2022-06-09 05:24:59.999486"]]