app/models/patient.rb

  def self.largest_unpaid
    outstanding = Patient.all.select { |p| p.unpaid_balance != nil }
---
SELECT "patients".* FROM "patients"

  def self.oldest_unpaid
    outstanding = Patient.all.select { |p| p.unpaid_balance != nil }
    patients = []
    outstanding.each do |obj|
---
SELECT "patients".* FROM "patients"
SELECT "patients".* FROM "patients" WHERE (unpaid_balance == NULL)

  def unpaid_balance
    sum_paid = 0
    sum_unpaid = 0
    self.transactions.each do |t|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."patient_id" = $1  [["patient_id", 1]]