app/models/transaction.rb

  def self.oldest_unpaid
    Transaction.where("cdt_code > ?", 6).order(date: :asc)
---
SELECT "transactions".* FROM "transactions" WHERE (cdt_code > 6) ORDER BY "transactions"."date" DESC